mask_option_instructions = {
    'instruction': '''Ты - ассистент, искусственный интеллект Сбербанка. Сейчас ты будешь помогать восстанаваливать утраченные фрагменты тестового датасета.
    Твоя задача - вставить пропущенный вариант ответа на вопрос, который помечен как [...].
    Формат ответа: одна фраза, которую нужно вставить в квадратные скобки [].
    ''',
    'shot': '''Вот пример работы:
    Сколько кредитных карт может оформить одно физическое лицо?
    Варианты ответов:
    A) [...]
    B) Две
    C) Одну
    D) Нисколько
    Твой вердикт: Не более десяти
    
    Ещё пример:
    Какое максимальное количество собственников у одной квартиры?
    A) Один
    B) Одиннадцать
    C) Не ограничено
    D) [...]
    Твой вердикт: Двое
    
    Конец примеров работы.\n
    ''',
    'postfix': '\nВставь недостающее слово: '
}

mask_word_instructions = {
    'instruction': '''Ты - ассистент, искусственный интеллект Сбербанка. Сейчас ты будешь помогать восстанаваливать утраченные фрагменты вопросов.
    Твоя задача - вставить одно и только одно слово на месте пропуска, который помечен как [...]. Отвечать на вопрос НЕ НУЖНО, МНЕ НЕ НУЖНЫ ОТВЕТЫ НА ВОПРОСЫ.
    Формат ответа: одно слово, которое нужно вставить в квадратные скобки [].
    ''',
    'shot': '''Вот пример работы:
    Сколько кредитных карт может оформить одно [...] лицо?
    Твой вердикт: физическое
    
    Ещё пример:
    Какое максимальное количество [...] у одной квартиры?
    Твой вердикт: собственников
    
    Конец примеров работы.\n
    ''',
    'postfix': '\nВставь недостающее слово: '
}

mmlu_instructions = {
    'instruction': '''Тебе будет предложен вопрос с вариантами ответа.
    Твоя задача - найти один и только один корректный вариант ответа. Отвечать на вопрос НЕ НУЖНО, МНЕ НЕ НУЖНЫ ОТВЕТЫ НА ВОПРОСЫ.
    Формат ответа: один символ, соответствующий правильному варианту ответа.''',
    'shot': '''Вот пример работы:
    Какие объекты недвижимости можно приобрести с использованием ипотечного кредита по программе строящееся жилье?
    Варианты ответа: {'A': 'Жилое помещение', 'B': 'Коммерческое помещение', 'C': 'Гараж', 'D': 'Офисное помещение'} 
    Твой вердикт: D

    Ещё пример:
    Какой минимальный первоначальный взнос необходим для получения кредита на коммерческую недвижимость?
    Варианты ответа: {'A': '10%', 'B': '20%', 'C': '30%', 'D': '40%'}
    Твой вердикт: C

    Конец примеров работы.\n
    ''',
    'options_prefix': ' Варианты ответа: ',
    'postfix': '\nОтветь одним символом: '
}

rubq_instructions = {
    'instruction': '''Тебе будет предложен вопрос и контекстная информация.
    Твоя задача - Создай краткий и информативный ответ (не более 50 слов) на заданный вопрос, основанный на твоих знаниях и контекстной информации''',
    'shot': '''Вот пример работы:
    Какие требования к возрасту для получения ипотеки без подтверждения дохода?
    Контекстная информация: ['Что такое ипотека и ипотечный кредит\nИпотечный кредит – долгосрочный кредит, предоставляемый банками под залог недвижимости.\n\nУчастники сделки (часть 1):\n1) Заемщик —физическое лицо, заключившее с банком кредитный договор либо представившее в банк пакет документов на получение кредита.\nТребования:\nа) Возраст: от 18 лет и до 75 лет на момент возврата кредита. б) Стаж работы: от 3 месяцев на нынешнем месте работы, за исключением неработающих пенсионеров и самозанятых.;\nв) Гражданство — Российская Федерация.\nДля граждан, прописанных в Крыму, потребуется регистрация по месту получения кредита. При подаче заявки указывается фактический адрес проживания клиента.\nЕсли человек берет кредит один, без привлечения иных лиц, то он будет называться заемщиком.\n2) Созаемщик - лицо, которое имеет равные права и обязанности c заемщиком, в том числе несет солидарную ответственность перед банком по погашению кредита (ст. 323 ГK PФ). Когда банк определяет сумму кредита, доходы coзaeмщикa учитываются наравне c доходами заемщика.\nТребования к созаемщику аналогичны требованиям, предъявляемым к заемщику. Созаемщиками по кредиту могут выступать не более 3 физических лиц, доход которых учитывается при расчете максимального размера кредита, за исключением по категории «Молодая семья» созаемщиков может быть не более шести.\nСупруг(а) титульного созаемщика является созаемщиком в обязательном порядке вне зависимости от его (ее) платежеспособности и возраста. Супруг(а) титульного созаемщика не включается в состав созаемщиков только в случаях:\nа) наличия действующего брачного договора, устанавливающего режим раздельной собственности на имущество супругов, в том числе в отношении недвижимости;\nб) Наличия нотариального согласия супруга (и) на заключение кредитного договора;\nв) Отсутствия гражданства Российской Федерации.\nСозаемщики без учета платежеспособности — в число созаемщиков допустимо включить лицо(а), имеющее право на получение денежных средств, выделенных за счет бюджета на оплату части стоимости кредитуемого объекта недвижимости.\n* Вне зависимости от его (их) платежеспособности, с учетом возраста, который должен составлять от 18 лет, при этом требование по максимально допустимому возрасту данного созаемщика не применяется, и являющегося родственником одного из созаемщиков (супруг(а), дети, родители, внуки, братья, сестры, племянники, бабушки, дедушки.)\nЧто должен предоставить клиент без учета платежеспособности: паспорт, документ, подтверждающий наличие субсидии, или документы, подтверждающие родство лица.\nВ качестве созаёмщиков можно привлекать не только законных супругов и родственников, но и других лиц. Созаемщик несет такую же ответственность по банковскому займу, как и основной должник. В случае его смерти созаемщик обеспечивает своевременные выплаты: он может выплачивать взносы по намеченному расписанию, а может закрыть договор досрочно имеющего субсидию, с одним из созаемщиков.\nНаличие созаемщиков увеличивает шансы получить ипотеку на более выгодных условиях и увеличить размер кредита; облегчает кредитную нагрузку, если платеж погашается совместно; созаемщик поможет с выплатой кредита, если что-то случится, и основной заемщик не сможет его погашать.', 'Требования к участникам кредитной сделки.\n\nСозаемщики\nСозаемщик - лицо, которое имеет равные права и обязанности с заемщиком, в том числе несет солидарную ответственность перед банком по погашению кредита (ст. 323 ГК РФ), когда банк определяет сумму кредита, доходы созаемщика учитываются наравне с доходами заемщика.\nТребования к созаемщику(ам) аналогичны требованиям, предъявляемым к заемщику.\nСозаемщиками по кредиту могут выступать не более 3 физических лиц, доход которых учитывается при расчете максимального размера кредита. Созаемщику не обязательно быть родственником титульного заемщика.\nИсключение: по категории «Молодая семья» созаемщиков может быть не более 6.\nНа основании ст. 45 Семейного кодекса РФ супруг(а) титульного созаемщика является созаемщиком в обязательном порядке вне зависимости от его (ее) платежеспособности и возраста.\nСупруг(а) титульного созаемщика не включается в состав созаемщиков только в случаях:\n- Наличия действующего брачного договора, устанавливающего режим раздельной собственности на имущество супругов, в том числе в отношении недвижимости\n- Наличия нотариального согласия супруга(и) на заключение кредитного договора\n- Отсутствия гражданства Российской Федерации.\nСозаемщики без учета платежеспособности\nВ число созаемщиков допустимо включить лицо(а), имеющее(ие) право на получение денежных средств, выделенных за счет бюджета на оплату части стоимости кредитуемого объекта недвижимости*.\n* Вне зависимости от его (их) платежеспособности, с учетом возраста, который должен составлять от 18 лет, при этом требование по максимально допустимому возрасту данного(ых) созаемщика(ов) не применяется, являющегося(икся) родственником(ами) одного из созаемщиков (супруг(а), дети, родители, внуки, братья, сестры, племянники, бабушки, дедушки).\nЧто должен предоставить клиент без учета платежеспособности?\n- Паспорт\n- Документ, подтверждающий наличие субсидии, и документы, подтверждающие родство лица, имеющего субсидию, с одним из созаемщиков.\nПоручитель -Физическое лицо (гражданин Российской Федерации), заключившее с банком договор поручительства.\nТребования к поручителю(ям) аналогичны требованиям, предъявляемым к заемщику. Максимальное число поручителей по одной кредитной сделке не более 8.\nПоручителей добавляют в двух случаях:\n1. Наделение долей\nПоручители - совершеннолетние члены семьи заемщика / титульного созаемщика и (или) его (ее) супруги(а) (вне зависимости от их платежеспособности и возраста) в собственность которых предполагается оформить кредитуемый объект недвижимости передаваемый в залог банку.\n2. Обеспечение\nПоручитель - человек, который гарантирует банку выплату кредита заемщиком и берет на себя финансовую ответственность по кредитным обязательствам. Если заемщик не сможет платить по ипотечному кредиту, погашение ипотеки и начисляемых процентов станет обязанностью поручителя. \n Различия условий для поручителя и созаемщика.\nДокументы\n- Поручитель предоставляет паспорт и документы, подтверждающие его доход и стабильность.\n- Созаемщик обычно предоставляет такой же набор документов, как и заемщик.\nКредитный договор\n- Банк заключает с поручителем отдельный договор\n- Созаемщик подписывает кредитный договор вместе с заемщиком, может влиять на его условия в ходе погашения кредита и оформлять ипотечные каникулы.']
    Твой ответ: от 18 до 65 лет
    Конец примеров работы:\n
    ''',
    'context_prefix': '''Контекстная информация:''',
    'postfix': '\nОтветь коротко: '
}
