ordinal_to_cardinal = {
    'первый': 'один',
    'второй': 'два',
    'третий': 'три',
    'четвёртый': 'четыре',
    'пятый': 'пять',
    'шестой': 'шесть',
    'седьмой': 'семь',
    'восьмой': 'восемь',
    'девятый': 'девять',
    'десятый': 'десять',
    'одиннадцатый': 'одиннадцать',
    'двенадцатый': 'двенадцать',
    'тринадцатый': 'тринадцать',
    'четырнадцатый': 'четырнадцать',
    'пятнадцатый': 'пятнадцать',
    'шестнадцатый': 'шестнадцать',
    'семнадцатый': 'семнадцать',
    'восемнадцатый': 'восемнадцать',
    'девятнадцатый': 'девятнадцать',
    'двадцатый': 'двадцать',
    'тридцатый': 'тридцать',
    'сороковой': 'сорок',
    'пятидесятый': 'пятьдесят',
    'шестидесятый': 'шестьдесят',
    'семидесятый': 'семьдесят',
    'восьмидесятый': 'восемьдесят',
    'девяностый': 'девяносто',
}

ordinal_powers_of_ten = {
    'сотый': 'сто',
    'тысячный': 'тысяча',
    'миллионный': 'миллион',
    'миллиардный': 'миллиард',
    'триллионный': 'триллион'
}

cardinal_powers_of_ten = {
    'десять': 10,
    'двадцать': 20,
    'тридцать': 30,
    'сорок': 40,
    'пятьдесят': 50,
    'шестьдесят': 60,
    'семьдесят': 70,
    'восемьдесят': 80,
    'девяносто': 90,
    'сто': 100,
    'двести': 200,
    'триста': 300,
    'четыреста': 400,
    'пятьсот': 500,
    'шестьсот': 600,
    'семьсот': 700,
    'восемьсот': 800,
    'девятьсот': 900,
    'тысяча': 1000,
    'тысяч': 1000,
    'тысячи': 1000,
    'миллион': 1_000_000,
    'миллиард': 1_000_000_000,
    'триллион': 1_000_000_000_000,
}

reducted_powers_of_ten = {
    'тыс.': 'тысяч',
    'млн.': 'миллионов',
    'млрд.': 'миллиардов',
    'трлн.': 'триллионов',
    'тыс': 'тысяч',
    'млн': 'миллионов',
    'млрд': 'миллиардов',
    'трлн': 'триллионов'
}

forms_of_one = {'один', 'одна', 'одно'}